FIO_Benchmark-suite/data/res-logs/ZOHO_HBA_SATA-16Drives/parallel_randread_4k_nj2_io8_205344.log
sda_randread_4k: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdb_randread_4k: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdc_randread_4k: (g=2): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdd_randread_4k: (g=3): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sde_randread_4k: (g=4): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdf_randread_4k: (g=5): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdg_randread_4k: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdh_randread_4k: (g=7): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdi_randread_4k: (g=8): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdj_randread_4k: (g=9): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdk_randread_4k: (g=10): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdl_randread_4k: (g=11): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdm_randread_4k: (g=12): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdn_randread_4k: (g=13): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdo_randread_4k: (g=14): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
sdp_randread_4k: (g=15): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
...
fio-3.19
Starting 32 processes

sda_randread_4k: (groupid=0, jobs=2): err= 0: pid=204543: Thu Feb 26 20:55:01 2026
  read: IOPS=37.9k, BW=148MiB/s (155MB/s)(8894MiB/60001msec)
    slat (nsec): min=1401, max=86284, avg=3354.78, stdev=2995.41
    clat (usec): min=42, max=3585, avg=417.69, stdev=162.23
     lat (usec): min=45, max=3588, avg=421.10, stdev=162.33
    clat percentiles (usec):
     | 50.0th=[  392], 95.0th=[  709], 99.0th=[  848], 99.9th=[ 1139]
   bw (  KiB/s): min=145513, max=158681, per=100.00%, avg=151879.44, stdev=1667.62, samples=118
   iops        : min=36377, max=39671, avg=37969.08, stdev=416.94, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=12.09%, 500=58.36%, 750=26.19%
  lat (usec)   : 1000=3.12%
  lat (msec)   : 2=0.17%, 4=0.05%
  cpu          : usr=1.75%, sys=5.99%, ctx=1545000, majf=0, minf=116
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2276863,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdb_randread_4k: (groupid=1, jobs=2): err= 0: pid=204545: Thu Feb 26 20:55:01 2026
  read: IOPS=38.3k, BW=150MiB/s (157MB/s)(8983MiB/60001msec)
    slat (nsec): min=1381, max=88522, avg=3317.08, stdev=2922.24
    clat (usec): min=37, max=3889, avg=413.57, stdev=165.58
     lat (usec): min=39, max=3892, avg=416.95, stdev=165.66
    clat percentiles (usec):
     | 50.0th=[  383], 95.0th=[  709], 99.0th=[  857], 99.9th=[ 1156]
   bw (  KiB/s): min=145226, max=158328, per=100.00%, avg=153390.71, stdev=1382.67, samples=118
   iops        : min=36305, max=39581, avg=38346.83, stdev=345.65, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=13.88%, 500=57.15%, 750=25.43%
  lat (usec)   : 1000=3.26%
  lat (msec)   : 2=0.21%, 4=0.05%
  cpu          : usr=1.81%, sys=5.85%, ctx=1599643, majf=0, minf=117
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2299523,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdc_randread_4k: (groupid=2, jobs=2): err= 0: pid=204547: Thu Feb 26 20:55:01 2026
  read: IOPS=38.3k, BW=150MiB/s (157MB/s)(8977MiB/60001msec)
    slat (nsec): min=1397, max=330480, avg=3351.47, stdev=2949.41
    clat (usec): min=31, max=22499, avg=413.82, stdev=190.24
     lat (usec): min=43, max=22503, avg=417.23, stdev=190.30
    clat percentiles (usec):
     | 50.0th=[  383], 95.0th=[  709], 99.0th=[  848], 99.9th=[ 1139]
   bw (  KiB/s): min=145284, max=160670, per=100.00%, avg=153280.86, stdev=1645.47, samples=118
   iops        : min=36320, max=40167, avg=38319.49, stdev=411.36, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=13.30%, 500=57.83%, 750=25.59%
  lat (usec)   : 1000=3.05%
  lat (msec)   : 2=0.17%, 4=0.05%, 50=0.01%
  cpu          : usr=1.85%, sys=5.87%, ctx=1574496, majf=0, minf=116
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2297993,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdd_randread_4k: (groupid=3, jobs=2): err= 0: pid=204549: Thu Feb 26 20:55:01 2026
  read: IOPS=38.6k, BW=151MiB/s (158MB/s)(9058MiB/60001msec)
    slat (nsec): min=1394, max=155948, avg=3315.81, stdev=2897.84
    clat (usec): min=37, max=3715, avg=410.09, stdev=161.87
     lat (usec): min=40, max=3720, avg=413.47, stdev=161.95
    clat percentiles (usec):
     | 50.0th=[  379], 95.0th=[  701], 99.0th=[  848], 99.9th=[ 1123]
   bw (  KiB/s): min=148978, max=160893, per=100.00%, avg=154692.19, stdev=1371.96, samples=118
   iops        : min=37244, max=40222, avg=38672.29, stdev=342.97, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=13.69%, 500=58.28%, 750=24.92%
  lat (usec)   : 1000=2.88%
  lat (msec)   : 2=0.17%, 4=0.05%
  cpu          : usr=1.78%, sys=5.95%, ctx=1630721, majf=0, minf=117
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2318903,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sde_randread_4k: (groupid=4, jobs=2): err= 0: pid=204551: Thu Feb 26 20:55:01 2026
  read: IOPS=37.9k, BW=148MiB/s (155MB/s)(8882MiB/60001msec)
    slat (nsec): min=1373, max=311478, avg=3368.64, stdev=2984.13
    clat (usec): min=32, max=3687, avg=418.27, stdev=162.32
     lat (usec): min=47, max=3689, avg=421.70, stdev=162.41
    clat percentiles (usec):
     | 50.0th=[  392], 95.0th=[  709], 99.0th=[  848], 99.9th=[ 1123]
   bw (  KiB/s): min=143783, max=158037, per=100.00%, avg=151652.86, stdev=1526.05, samples=118
   iops        : min=35945, max=39509, avg=37912.46, stdev=381.48, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=11.96%, 500=58.27%, 750=26.39%
  lat (usec)   : 1000=3.15%
  lat (msec)   : 2=0.17%, 4=0.05%
  cpu          : usr=1.79%, sys=5.86%, ctx=1545616, majf=0, minf=116
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2273681,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdf_randread_4k: (groupid=5, jobs=2): err= 0: pid=204553: Thu Feb 26 20:55:01 2026
  read: IOPS=38.4k, BW=150MiB/s (157MB/s)(8997MiB/60001msec)
    slat (nsec): min=1370, max=91430, avg=3312.58, stdev=2880.85
    clat (usec): min=47, max=3618, avg=412.93, stdev=161.23
     lat (usec): min=50, max=3624, avg=416.31, stdev=161.34
    clat percentiles (usec):
     | 50.0th=[  383], 95.0th=[  701], 99.0th=[  848], 99.9th=[ 1139]
   bw (  KiB/s): min=148065, max=158964, per=100.00%, avg=153641.86, stdev=1265.93, samples=118
   iops        : min=37015, max=39741, avg=38409.63, stdev=316.50, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=12.89%, 500=58.68%, 750=25.27%
  lat (usec)   : 1000=2.92%
  lat (msec)   : 2=0.18%, 4=0.05%
  cpu          : usr=1.77%, sys=5.92%, ctx=1630603, majf=0, minf=117
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2303104,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdg_randread_4k: (groupid=6, jobs=2): err= 0: pid=204555: Thu Feb 26 20:55:01 2026
  read: IOPS=38.2k, BW=149MiB/s (157MB/s)(8959MiB/60001msec)
    slat (nsec): min=1397, max=77977, avg=3347.83, stdev=2906.39
    clat (usec): min=46, max=3909, avg=414.63, stdev=162.35
     lat (usec): min=47, max=3914, avg=418.04, stdev=162.45
    clat percentiles (usec):
     | 50.0th=[  383], 95.0th=[  701], 99.0th=[  848], 99.9th=[ 1139]
   bw (  KiB/s): min=146578, max=157583, per=100.00%, avg=152989.95, stdev=1363.78, samples=118
   iops        : min=36643, max=39395, avg=38246.71, stdev=340.90, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=12.81%, 500=58.27%, 750=25.64%
  lat (usec)   : 1000=3.04%
  lat (msec)   : 2=0.19%, 4=0.05%
  cpu          : usr=1.78%, sys=5.92%, ctx=1600983, majf=0, minf=117
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2293538,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdh_randread_4k: (groupid=7, jobs=2): err= 0: pid=204557: Thu Feb 26 20:55:01 2026
  read: IOPS=38.3k, BW=150MiB/s (157MB/s)(8983MiB/60001msec)
    slat (nsec): min=1393, max=251409, avg=3339.07, stdev=2968.85
    clat (usec): min=36, max=3708, avg=413.55, stdev=164.14
     lat (usec): min=43, max=3711, avg=416.95, stdev=164.22
    clat percentiles (usec):
     | 50.0th=[  383], 95.0th=[  709], 99.0th=[  857], 99.9th=[ 1123]
   bw (  KiB/s): min=146986, max=159028, per=100.00%, avg=153403.95, stdev=1226.78, samples=118
   iops        : min=36746, max=39756, avg=38350.19, stdev=306.63, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=13.63%, 500=57.34%, 750=25.62%
  lat (usec)   : 1000=3.16%
  lat (msec)   : 2=0.19%, 4=0.05%
  cpu          : usr=1.88%, sys=5.86%, ctx=1571663, majf=0, minf=117
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2299554,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdi_randread_4k: (groupid=8, jobs=2): err= 0: pid=204559: Thu Feb 26 20:55:01 2026
  read: IOPS=38.5k, BW=150MiB/s (158MB/s)(9018MiB/60001msec)
    slat (nsec): min=1382, max=154522, avg=3291.63, stdev=2889.31
    clat (usec): min=39, max=3500, avg=411.98, stdev=163.50
     lat (usec): min=40, max=3502, avg=415.33, stdev=163.58
    clat percentiles (usec):
     | 50.0th=[  379], 95.0th=[  709], 99.0th=[  848], 99.9th=[ 1123]
   bw (  KiB/s): min=147256, max=160087, per=100.00%, avg=153995.98, stdev=1597.02, samples=118
   iops        : min=36813, max=40021, avg=38498.25, stdev=399.25, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=13.86%, 500=57.58%, 750=25.24%
  lat (usec)   : 1000=3.08%
  lat (msec)   : 2=0.18%, 4=0.05%
  cpu          : usr=1.74%, sys=5.88%, ctx=1613033, majf=0, minf=116
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2308547,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdj_randread_4k: (groupid=9, jobs=2): err= 0: pid=204561: Thu Feb 26 20:55:01 2026
  read: IOPS=38.3k, BW=150MiB/s (157MB/s)(8975MiB/60001msec)
    slat (nsec): min=1396, max=216798, avg=3357.64, stdev=2971.69
    clat (usec): min=38, max=8002, avg=413.88, stdev=189.37
     lat (usec): min=40, max=8015, avg=417.30, stdev=189.44
    clat percentiles (usec):
     | 50.0th=[  379], 95.0th=[  709], 99.0th=[  857], 99.9th=[ 1221]
   bw (  KiB/s): min=132839, max=159623, per=100.00%, avg=153235.73, stdev=2139.34, samples=118
   iops        : min=33209, max=39905, avg=38308.24, stdev=534.82, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=13.79%, 500=57.39%, 750=25.41%
  lat (usec)   : 1000=3.14%
  lat (msec)   : 2=0.18%, 4=0.05%, 10=0.02%
  cpu          : usr=1.82%, sys=5.93%, ctx=1563246, majf=0, minf=117
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2297584,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdk_randread_4k: (groupid=10, jobs=2): err= 0: pid=204563: Thu Feb 26 20:55:01 2026
  read: IOPS=38.4k, BW=150MiB/s (157MB/s)(9001MiB/60001msec)
    slat (nsec): min=1392, max=250747, avg=3334.89, stdev=2953.60
    clat (usec): min=41, max=3880, avg=412.69, stdev=162.16
     lat (usec): min=43, max=3882, avg=416.08, stdev=162.26
    clat percentiles (usec):
     | 50.0th=[  383], 95.0th=[  701], 99.0th=[  848], 99.9th=[ 1123]
   bw (  KiB/s): min=145002, max=161154, per=100.00%, avg=153708.41, stdev=1753.26, samples=118
   iops        : min=36249, max=40288, avg=38426.41, stdev=438.31, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=13.37%, 500=57.99%, 750=25.39%
  lat (usec)   : 1000=3.02%
  lat (msec)   : 2=0.17%, 4=0.05%
  cpu          : usr=1.77%, sys=5.97%, ctx=1588556, majf=0, minf=117
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2304322,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdl_randread_4k: (groupid=11, jobs=2): err= 0: pid=204565: Thu Feb 26 20:55:01 2026
  read: IOPS=38.4k, BW=150MiB/s (157MB/s)(9012MiB/60001msec)
    slat (nsec): min=1388, max=203025, avg=3315.70, stdev=2914.76
    clat (usec): min=51, max=3674, avg=412.23, stdev=161.98
     lat (usec): min=55, max=3679, avg=415.61, stdev=162.07
    clat percentiles (usec):
     | 50.0th=[  379], 95.0th=[  701], 99.0th=[  848], 99.9th=[ 1106]
   bw (  KiB/s): min=148197, max=159432, per=100.00%, avg=153890.10, stdev=1254.30, samples=118
   iops        : min=37049, max=39857, avg=38471.73, stdev=313.53, samples=118
  lat (usec)   : 100=0.01%, 250=13.38%, 500=58.12%, 750=25.27%, 1000=3.00%
  lat (msec)   : 2=0.17%, 4=0.05%
  cpu          : usr=1.81%, sys=5.88%, ctx=1597662, majf=0, minf=117
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2306995,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdm_randread_4k: (groupid=12, jobs=2): err= 0: pid=204567: Thu Feb 26 20:55:01 2026
  read: IOPS=38.3k, BW=150MiB/s (157MB/s)(8984MiB/60001msec)
    slat (nsec): min=1399, max=255963, avg=3334.52, stdev=2941.07
    clat (usec): min=40, max=3652, avg=413.50, stdev=164.58
     lat (usec): min=42, max=3654, avg=416.89, stdev=164.66
    clat percentiles (usec):
     | 50.0th=[  379], 95.0th=[  709], 99.0th=[  857], 99.9th=[ 1123]
   bw (  KiB/s): min=147443, max=159380, per=100.00%, avg=153413.61, stdev=1315.50, samples=118
   iops        : min=36860, max=39844, avg=38352.58, stdev=328.86, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=13.71%, 500=57.23%, 750=25.58%
  lat (usec)   : 1000=3.23%
  lat (msec)   : 2=0.20%, 4=0.05%
  cpu          : usr=1.87%, sys=5.89%, ctx=1574448, majf=0, minf=115
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2299843,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdn_randread_4k: (groupid=13, jobs=2): err= 0: pid=204569: Thu Feb 26 20:55:01 2026
  read: IOPS=38.4k, BW=150MiB/s (157MB/s)(8997MiB/60001msec)
    slat (nsec): min=1384, max=236760, avg=3319.47, stdev=2938.37
    clat (usec): min=32, max=3920, avg=412.92, stdev=163.89
     lat (usec): min=42, max=3922, avg=416.30, stdev=163.96
    clat percentiles (usec):
     | 50.0th=[  379], 95.0th=[  709], 99.0th=[  857], 99.9th=[ 1123]
   bw (  KiB/s): min=147637, max=160343, per=100.00%, avg=153621.46, stdev=1392.60, samples=118
   iops        : min=36908, max=40085, avg=38404.59, stdev=348.14, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=13.62%, 500=57.58%, 750=25.40%
  lat (usec)   : 1000=3.15%
  lat (msec)   : 2=0.19%, 4=0.05%
  cpu          : usr=1.79%, sys=5.84%, ctx=1595324, majf=0, minf=117
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2303159,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdo_randread_4k: (groupid=14, jobs=2): err= 0: pid=204571: Thu Feb 26 20:55:01 2026
  read: IOPS=38.2k, BW=149MiB/s (157MB/s)(8960MiB/60002msec)
    slat (nsec): min=1405, max=204620, avg=3330.33, stdev=2933.16
    clat (usec): min=49, max=7182, avg=414.59, stdev=185.90
     lat (usec): min=53, max=7185, avg=417.98, stdev=185.98
    clat percentiles (usec):
     | 50.0th=[  383], 95.0th=[  709], 99.0th=[  857], 99.9th=[ 1221]
   bw (  KiB/s): min=129420, max=160358, per=100.00%, avg=152994.92, stdev=2275.40, samples=118
   iops        : min=32354, max=40088, avg=38247.93, stdev=568.84, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=13.48%, 500=57.69%, 750=25.49%
  lat (usec)   : 1000=3.08%
  lat (msec)   : 2=0.18%, 4=0.05%, 10=0.02%
  cpu          : usr=1.82%, sys=5.82%, ctx=1575057, majf=0, minf=118
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2293863,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
sdp_randread_4k: (groupid=15, jobs=2): err= 0: pid=204573: Thu Feb 26 20:55:01 2026
  read: IOPS=37.8k, BW=148MiB/s (155MB/s)(8852MiB/60001msec)
    slat (nsec): min=1395, max=122864, avg=3376.95, stdev=2961.35
    clat (usec): min=45, max=3740, avg=419.64, stdev=163.55
     lat (usec): min=47, max=3742, avg=423.08, stdev=163.64
    clat percentiles (usec):
     | 50.0th=[  392], 95.0th=[  717], 99.0th=[  857], 99.9th=[ 1139]
   bw (  KiB/s): min=143119, max=157469, per=100.00%, avg=151170.34, stdev=1318.16, samples=118
   iops        : min=35779, max=39367, avg=37791.86, stdev=329.48, samples=118
  lat (usec)   : 50=0.01%, 100=0.01%, 250=12.03%, 500=57.97%, 750=26.41%
  lat (usec)   : 1000=3.34%
  lat (msec)   : 2=0.20%, 4=0.05%
  cpu          : usr=1.77%, sys=5.93%, ctx=1559723, majf=0, minf=116
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2266197,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=148MiB/s (155MB/s), 148MiB/s-148MiB/s (155MB/s-155MB/s), io=8894MiB (9326MB), run=60001-60001msec

Run status group 1 (all jobs):
   READ: bw=150MiB/s (157MB/s), 150MiB/s-150MiB/s (157MB/s-157MB/s), io=8983MiB (9419MB), run=60001-60001msec

Run status group 2 (all jobs):
   READ: bw=150MiB/s (157MB/s), 150MiB/s-150MiB/s (157MB/s-157MB/s), io=8977MiB (9413MB), run=60001-60001msec

Run status group 3 (all jobs):
   READ: bw=151MiB/s (158MB/s), 151MiB/s-151MiB/s (158MB/s-158MB/s), io=9058MiB (9498MB), run=60001-60001msec

Run status group 4 (all jobs):
   READ: bw=148MiB/s (155MB/s), 148MiB/s-148MiB/s (155MB/s-155MB/s), io=8882MiB (9313MB), run=60001-60001msec

Run status group 5 (all jobs):
   READ: bw=150MiB/s (157MB/s), 150MiB/s-150MiB/s (157MB/s-157MB/s), io=8997MiB (9434MB), run=60001-60001msec

Run status group 6 (all jobs):
   READ: bw=149MiB/s (157MB/s), 149MiB/s-149MiB/s (157MB/s-157MB/s), io=8959MiB (9394MB), run=60001-60001msec

Run status group 7 (all jobs):
   READ: bw=150MiB/s (157MB/s), 150MiB/s-150MiB/s (157MB/s-157MB/s), io=8983MiB (9419MB), run=60001-60001msec

Run status group 8 (all jobs):
   READ: bw=150MiB/s (158MB/s), 150MiB/s-150MiB/s (158MB/s-158MB/s), io=9018MiB (9456MB), run=60001-60001msec

Run status group 9 (all jobs):
   READ: bw=150MiB/s (157MB/s), 150MiB/s-150MiB/s (157MB/s-157MB/s), io=8975MiB (9411MB), run=60001-60001msec

Run status group 10 (all jobs):
   READ: bw=150MiB/s (157MB/s), 150MiB/s-150MiB/s (157MB/s-157MB/s), io=9001MiB (9439MB), run=60001-60001msec

Run status group 11 (all jobs):
   READ: bw=150MiB/s (157MB/s), 150MiB/s-150MiB/s (157MB/s-157MB/s), io=9012MiB (9450MB), run=60001-60001msec

Run status group 12 (all jobs):
   READ: bw=150MiB/s (157MB/s), 150MiB/s-150MiB/s (157MB/s-157MB/s), io=8984MiB (9420MB), run=60001-60001msec

Run status group 13 (all jobs):
   READ: bw=150MiB/s (157MB/s), 150MiB/s-150MiB/s (157MB/s-157MB/s), io=8997MiB (9434MB), run=60001-60001msec

Run status group 14 (all jobs):
   READ: bw=149MiB/s (157MB/s), 149MiB/s-149MiB/s (157MB/s-157MB/s), io=8960MiB (9396MB), run=60002-60002msec

Run status group 15 (all jobs):
   READ: bw=148MiB/s (155MB/s), 148MiB/s-148MiB/s (155MB/s-155MB/s), io=8852MiB (9282MB), run=60001-60001msec

Disk stats (read/write):
  sda: ios=2839806/0, merge=0/0, ticks=1163877/0, in_queue=1163877, util=99.75%
  sdb: ios=2867438/0, merge=0/0, ticks=1164554/0, in_queue=1164554, util=99.76%
  sdc: ios=2863300/0, merge=0/0, ticks=1163492/0, in_queue=1163492, util=99.79%
  sdd: ios=2889342/0, merge=0/0, ticks=1164386/0, in_queue=1164385, util=99.80%
  sde: ios=2835546/0, merge=0/0, ticks=1163934/0, in_queue=1163934, util=99.82%
  sdf: ios=2865214/0, merge=0/0, ticks=1164866/0, in_queue=1164866, util=99.82%
  sdg: ios=2858503/0, merge=0/0, ticks=1164518/0, in_queue=1164517, util=99.85%
  sdh: ios=2866610/0, merge=0/0, ticks=1163445/0, in_queue=1163444, util=99.88%
  sdi: ios=2877338/0, merge=0/0, ticks=1164691/0, in_queue=1164691, util=99.90%
  sdj: ios=2866749/0, merge=0/0, ticks=1163555/0, in_queue=1163554, util=99.93%
  sdk: ios=2872985/0, merge=0/0, ticks=1164025/0, in_queue=1164025, util=99.95%
  sdl: ios=2876464/0, merge=0/0, ticks=1164336/0, in_queue=1164336, util=99.98%
  sdm: ios=2860756/0, merge=0/0, ticks=1163888/0, in_queue=1163888, util=99.99%
  sdn: ios=2871311/0, merge=0/0, ticks=1164564/0, in_queue=1164564, util=100.00%
  sdo: ios=2862440/0, merge=0/0, ticks=1164110/0, in_queue=1164111, util=100.00%
  sdp: ios=2825230/0, merge=0/0, ticks=1164406/0, in_queue=1164406, util=100.00%